Revit 2027 API
Part.CanOffsetFace Method
 Checks if it is possible to offset the given face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanOffsetFace(
	Face face
)
Public Function CanOffsetFace (
	face As Face
) As Boolean
public:
bool CanOffsetFace(
	Face^ face
)
member CanOffsetFace :
        face : Face -> bool
Parameters
face Face
 face to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace